---
title: PointOnEdge
classe: Autodesk.Revit.DB.PointOnEdge
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.PointElementReference
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# PointOnEdge

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `PointLocationOnCurve LocationOnCurve { get; }` | `pointOnEdge.LocationOnCurve` | PointLocationOnCurve |
| `Reference GetEdgeReference()` | `pointOnEdge.GetEdgeReference()` | Reference |
| `Void SetEdgeReference(Reference)` | `pointOnEdge.SetEdgeReference(reference)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```